import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class BreackfastTab2 extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                     prise:'85000',
                    title : 'آماده کردن سوپ تخم‌مرغ در ۱۰ دقیقه',
                    prise:'85000',
                    imageUrl :require("./../../assets/images/lunch/Tab2/i1.jpg"),
                    body : 'سوپ تخم‌مرغ حتما از مواد اولیه با کیفیت استفاده کنید. جایی برای خساست وجود ندارد، باید از مواد تازه و مفید استفاده کنید. گیاهخواران می‌توانند به‌جای مرغ از سبزیجات استفاده کنند. بااین‌حال هنوز هم مزه غذای شما خوشمزه باقی می‌ماند. اگر خیلی گرسنه هستید سفیده تخم‌مرغ را بیشتر کنید. در صورت تمایل و بنابر ذائقه خود می‌توانید از سبزیجاتی مانند ذرت استفاده کنید.   مواد لازم:   این مواد برای سیر کردن ۴ نفر کافی هستند. ۲ عدد تخم‌مرغ بزرگ  ۱ سفیده تخم‌مرغ  یک و نیم قاشق غذاخوری نشاسته ذرت  ۴ فنجان تکه مرغ  یک‌چهارم قاشق غذاخوری ادویه سیر  یک‌هشتم قاشق غذاخوری فلفل سیاه  یک‌هشتم قاشق غذاخوری زنجبیل زمینی  ۶ عدد ساقه پیازچه  دستور پخت  تخم‌مرغ‌ها و سفیده را دریک کاسه ریخته و خوب هم بزنید.  سه‌چهارم مرغ را در یک ظرف ریخته، نشاسته ذرت را اضافه کرده و خوب هم بزنید.  در یک قابلمه آب ریخته، سپس ادویه سیر، زنجبیل، فلفل سیه و پیازچه را اضافه کنید. آن را خوب هم زده و بگذارید تا جوش بیاید.  مخلوط نشاسته و مرغ را به این مواد اضافه کرده و اجازه دهید ۱ تا ۲ دقیقه حرارت ببیند.  سپس دوباره شعله را زیاد کرده و با یکی قاشق چوبی یا پلاستیکی، به‌آرامی مواد را در جهت عقربه‌های ساعت هم بزنید. سپس به‌آرامی مخلوط تخم‌مرغ را اضافه نموده و درهمان حال هم بزنید.  سپس بگذارید مواد حدود ۳۰ ثانیه حرارت ببینند تا تخم‌مرغ‌ها خوب بپزند.  سوپ را در ۴ ظرف ریخته و با ساقه پیازچه آن را تزئین کنید. نوش جان!'
                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : 'پیتزا پورتوبلو',
                    imageUrl :require("./../../assets/images/lunch/Tab2/i2.jpg"),
                    body : 'به گوشت و سبزیجات خود ادویه بزنید و غذایی درست کنید که خانواده تان به زودی آن را فراموش نکند. بسته به نوع گوشتی که انتخاب می کنید، پخت مواد اولیه شما باید حدود 10 دقیقه طول بکشد. '
                   
                },
                { 
                    id:'3',
                    prise:'20000',
                    title :"پد آسان تایلندی",
                    imageUrl :require("./../../assets/images/lunch/Tab2/i3.jpg"),
                    body : 'مواد لازم ۲۰۰ گرم رشته ماکارونی ۲ قاشق چای‌خوری روغن گیاهی ۱ عدد تخم‌مرغ نصف فنجان آب ۲ قاشق چای‌خوری کره بادام‌زمینی ترد ۲ قاشق چای‌خوری سس سویا۲ قاشق چای‌خوری آب‌لیمو   ۲ قاشق چای‌خوری شکر قهوه‌ای  نصف قاشق چای‌خوری زنجبیل  یک‌چهارم قاشق چای‌خوری فلفل قرمز  ۱ فنجان جوانه لوبیا  دستور تهیه ماکارونی را بپزید. روغن را دریک ظرف بزرگ ریخته، روی شعله متوسط بگذارید. سپس تخم‌مرغ را اضافه کنید و بگذارید ۳۰ ثانیه سرخ شود (البته نباید کاملاً سرخ شود).  سپس ماکارونی پخته‌شده و مواد دیگر، به‌جز جوانه لوبیا را به آن اضافه کنید. مواد را تفت‌داده و بگذارید خوب بپزد تا تمام آب مواد توسط ماکارونی گرفته شود. سپس جوانه لوبیا را اضافه کرده و با باقی مواد بپزید. در صورت تمایل می‌توانید آن را با بادام خردشده، پیاز و لیمو نوش جان کنید.'
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : 'پاستا پستو',
                    imageUrl :require("./../../assets/images/lunch/Tab2/i4.jpg"), 
                      body : 'پاستا 1 پیمانه   آب 4 پیمانه   نمک 1/3 قاشق چایخوری   برای سس پستو: برگ ریحان تازه 1 پیمانه    بادام 1/8 پیمانه  روغن زیتون فوق بکر 1 و 1/2 قاشق غذاخوری  سیر 1 حبه  فلفل سیاه 1/2 قاشق چایخوری  نمک به مقدار لازم '+"تابه ای را روی شعله قرار دهید تا داغ شود. بادام خام را داخل تابه بریزید. شعله را کم کنید و 2-3 دقیقه تفت بدهید تا کمی بوداده شوند. در این مدت مرتب هم بزنید تا نسوزند. سپس آنها را کنار بگذارید تا خنک شوند. بادام سس پستو مرحله دوم:  بعد از این که بادام ها خنک شدند آنها را در غذاساز بریزید و میکس کنید تا خرد شوند.  بیف‌‌استروگانف و چیکن‌‌استروگانف؛ طرز تهیه به همراه تاریخچه و آداب آشپزی روسی  هومن سیدی و مهناز افشار در گلشیفته  تا 40% تخفیف رانرهای زیبا با طرح های ایرانی که هرجایی پیدا نمیکنید!  خرید از بهترین برندهای لباس با کدتخفیف 35000 تومانی مدیسه!  بادام خرد شده  مرحله سوم: یک پیمانه برگ ریحان که به خوبی شسته و خشک شده اند را اضافه کنید. 1 حبه سیر کوچک و مقداری فلفل و نمک هم اضافه کنید. ریحان و سیر مرحله چهارم:  شروع به میکس کردن کنید و به تدریج روغن زیتون را نیز اضافه کنید. بعد از این که سس آماده شد آن را بچشید و نمک و فلفل را به ذائقه خود تنظیم کنید. 5-6 قاشق از سس برای پاستای هر نفر کافی است. میتوانید سس اضافی را در یخچال نگه دارید. سس پستو مرحله پنجم: حال 4 پیمانه آب را داخل قابلمه ای بریزید و بگذارید جوش بیاید. وقتی جوش آمد به آن نمک بزنید. پاستای خشک را داخل آب جوش بریزید. 7-8 دقیقه صبر کنید تا پاستا پخته شود. سپس آن را آبکش کنید.  پخت پاستا  مرحله ششم: پاستای آبکش شده را داخل ظرف سس پستو بریزید و مخلوط کنید. روی پاستا میتوانید کمی فلفل و آویشن بزنید.  پاستا با سس پستو  در آخر مقداری پنیر پارمزان هم برای طعم بهتر روی پاستا بریزید و نوش جان کنید.  پاستا پستو  نکته: برای این که سس پستو رنگ سبز زیبایش را حفظ کند میتوانید چند قطره آبلیمو به آن اضافه کنید.  این که بادام در سس کاملاً پودر شود یا کمی درشت تر باشد و زیر دندان بیاید بستگی به ذائقه شما دارد.  سس پستو را میتوانید تا 5 روز در ظرف در بسته در یخچال نگه دارید."
                },
                {
                    id:'5',
                    prise:'70000',
                    title : '  طرز تهیه کباب لاپلو',
                    imageUrl :require("./../../assets/images/lunch/Tab2/i5.jpg"),
                    body :"گوشت چرخکرده 200 گرم برنج 2 پیمانه پیاز 1 عدد نمک، فلفل و زردچوبه به مقدار کافی ماست چکیده 1 قاشق غذاخوری زعفران دم کرده 2 قاشق غذاخوری روغن 4 قاشق غذاخوری سیب زمینی 1 عدد (دلخواه)"+" گوشت چرخکرده را در کاسه ای بریزید. پیاز را رنده و به آن اضافه کنید.نمک، فلفل و زردچوبه را اضافه کنید و خوب همه مواد را با هم ورز بدهید.یک قاشق ماست چکیده اضافه کنید و مجدداً هم بزنید. گوشت آماده شده را تا آماده شدن برنج در یخچال قرار دهید تا کمی خودش را بگیرد.برنج را پس از شست و شو، در یک قابلمه کوچک محتوی آب بریزید و روی شعله قرار دهید. بعد از 8-10 دقیقه که نیم پز شد (بسته به نوع برنج ممکن است زمان کمتر یا بیشتر هم باشد) آن را آبکش کنید.کف قابلمه دو قاشق روغن بریزید. زعفران را هم اضافه کنید و قابلمه را روی شعله ملایم بگذارید.گوشت را از یخچال خارج کنید و آن را به سه یا چهار قسمت مساوی تقسیم کنید. یک لایه برنج کف قابلمه بریزیدسپس یک قسمت از گوشت را بردارید و به شکل دایره روی برنج پهن کنید، طوری که با دیواره قابلمه فاصله داشته باشد.دوباره برنج بریزید و این کار را به ترتیب لایه لایه ادامه دهید تا همه برنج ها و گوشت ها مصرف شوند و لایه رویی برنج باشد. روی هر لایه نصف قاشق هم روغن بریزید.در آخر میتوانید یک عدد سیب زمینی را نازک هم حلقه حلقه کنید و روی برنج بچینید. در قابلمه را ببندید و بگذارید حدود 1 ساعت روی شعله خیلی کم بماند. بهتر است از شعله پخشکن استفاده کنید.بعد از این مدت بگذارید کمی خنک شود. سپس کباب لاپلو را در دیس برگردانید. برش بزنید و همراه با گوجه سرخکرده و ماست سرو کنید." 


                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'اسپاگتی ',
                    imageUrl :require("./../../assets/images/lunch/Tab1/i6.jpg"),
                    body :"گوشت چرخکرده 350 گرم  سیب زمینی نسبتاً بزرگ 2 عدد  پیاز متوسط 1 عدد  پودر سیر 1 قاشق پایخوری  پودر پیاز 1 قاشق غذاخوری  پودر سوخاری 3 قاشق غذاخوری تخم مرغ 1 عدد  نمک 1 قاشق چایخوری  زردچوبه 2 قاشق چایخوری"+"مواد لازم برای تهیه این کتلت ترد و خوشمزه عبارتند از: گوشت چرخکرده، سیب زمینی، پیاز، پودر سوخاری، پودر سیر، پودر پیاز، زردچوبه و نمک. کالری کتلت و ارزش غذایی آن بستگی به مواد استفاده شده در آن دارد. در اینجا جدول کالری و ارزش غذایی بر اساس مواد ذکر شده به علاوه سه قاشق روغن زیتون برای سرخ کردن محاسبه شده استکتلت خوشمزه. توجه کنید که کالری روغن آفتابگردان از روغن زیتون بیشتر نیست. بلکه فقط چربی روغن زیتون از نوع سالم تری است. سیب زمینی را پوست بکنید و رنده کنید و آب آن را به طور کامل جدا کنید. پیاز را نیز رنده کنید و آب آن را بگیرید. حال پیاز رنده شده را به سیب زمینی اضافه کنید.گوشت چرخ کرده را به همراه ادویه ها، پودر سوخاری و تخم مرغ  به مخلوط پیاز و سیب زمینی اضافه کنید و به مدت 10 دقیقه هم بزنید تا کامل با یکدیگر مخلوط شوند. مایه کتلت را به مدت 2 ساعت در یخچال قرار دهید.پس از این مدت که مایه خودش را گرفت، تکه تکه از آن بردارید و به شکل دلخواه خود (بیضی، دایره، مستطیل و…) در بیاورید.تابه ای را روی حرارت قرار دهید و کمی روغن کف آن بریزید. کتلت ها را داخل تابه داغ شده بچینید و دو طرف آنها را تا زمانی که به رنگ طلایی در بیایند سرخ کنید.کتلت را با نان، سیب زمینی سرخ کرده، سبزی خوردن و ماست یا سس دلخواه سرو کنید. نوش جان!1- اگر آب سیب زمینی و پیاز را نگیرید مایه بیش از حد شل میشود. 2- قرار دادن مایه در یخچال ضروری نیست اما به وا نرفتن کتلتها موقع سرخ شدن کمک زیادی میکند. اگر وقت ندارید مایه را 5 دقیقه در فریزر قرار دهید. 3- برای تهیه این غذا بهتر است از گوشت گوسفندی کم چرب استفاده شود. "
                },
            ]
        })
    }

    render(){
        return(
            <Container  >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../../assets/images/l.jpg')} >
    <Content    >
       <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:1,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})