import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class BreackfastTab3s extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                    prise:'85000',
                   title : ' ساق مرغ در فر ',
                   prise:'85000',
                   imageUrl :require('./../../assets/images/lunch/Tab3/i1.jpg'),
                   body : 'ساق مرغ 14 عدد  روغن زیتون تصفیه شده 1/4 پیمانه  سیر رنده شده یا له شده 4 حبه  جعفری خرد شده 4 قاشق غذاخوری  آبلیموی تازه 3 قاشق غذاخوری  سس خردل 2 قاشق غذاخوری  نمک 1 قاشق غذاخوری  فلفل سیاه 1/2 قاشق چایخوری'+"اول از همه سیر را رنده و جعفری را خیلی ریز خرد کنید. بعد روغن زیتون را در کاسه کوچکی بریزید. سیر، جعفری، آبلیمو، خردل، نمک و فلفل را به آن اضافه کنید و خوب هم بزنید.ساق های مرغ را در کاسه بزرگی قرار دهید. سس را روی آن بریزید و با دست زیر و رو کنید تا همه ساق ها خوب به آن آغشته شوند. سعی کنید کمید از سس را زیر پوست مرغ فشار دهید تا ساق ها خوب طعم دار شوند. سپس روی کاسه را با سلفون بپوشانید و 6 ساعت یا از شب تا صبح بگذارید به همان حال بماند.فر را از قبل با دمای 200 درجه سانتیگراد روشن کنید تا گرم شود. کف سینی فر دارای خطوط برجسته (مثل تابه گریل) فویل آلومینیومی بکشید یا از روکش سیلیکونی سینی فر استفاده کنید. تا فر گرم میشود، ساق ها را از یخچال خارج کنید و روی فویل بچینید تا به دمای اتاق برسند. سمت پوست دار ساق باید روی سینی قرار بگیرد.اگر از سس چیزی در کاسه باقی مانده آن را روی ساق مرغ ها بمالید. سینی را 25 دقیقه در طبقه وسط فر قرار دهید. بعد از این مدت به کمک انبر یا دو چنگال ساق ها را در سینی بچرخانید و سینی را 25 دقیقه دیگر در فر بگذارید. برای برشته شدن پوست مرغ میتوانید در آخر یکی دو دقیقه شعله بالای فر را روشن کنید.وقتی ساق مرغ در فر پخته شد سینی را خارج کنید و روی ساقها جعفری تازه خرد شده بریزید غذا را سرو کنید.اه دیگر آغشته کردن مرغ به سس این است که آن را همراه با سس داخل کیسه زیپ داری بریزید. زیپ را ببندید و کیسه را خوب تکان دهید سپس بگذارید 6 ساعت بماند."                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : 'طرز تهیه خوراک گوشت و قارچ',
                    imageUrl :require("./../../assets/images/lunch/Tab3/i2.jpg"),
                    body : 'سیب زمینی 4 عدد گوشت چرخ کرده 250 گرم    پیاز 1 عدد    قارچ 250 گرم    فلفل دلمه ای نصف 1 عدد    شیر 4 قاشق غذاخوری    نمک، فلفل و زردچوبه به مقدار کافی  رب گوجه 2 قاشق غذاخوری   آویشن 1 قاشق چایخوری'+"سیب زمینی ها را در قابلمه آب جوش بریزید و بگذارید خوب آب پز و نرم شوند. بعد از خنک شدن، آنها را پوست بکنید و با پوره ساز یا گوشتکوب به خوبی له کنید.شیر را به سیب زمینی له شده اضافه کنید. کمی هم نمک بزنید و مخلوط کنید. حال برای تهیه گراتن، پوره سیب زمینی آماده شده را کف ظرف مورد نظر یکنواخت پهن کنید.قارچ را خرد کنید و در تابه روغن بریزید. وقتی آب قارچ کشیده شد کمی آن را تفت بدهید تا پخته شود و آن را کنار بگذارید. پیاز را کاملاً ریز کنید و در روغن تفت بدهید تا شروع به طلایی شدن کند. سپس کمی زردچوبه به آن بزنید. گوشت چرخ کرده را نیز اضافه کنید. نمک، فلفل و کمی دیگر زردچوبه بزنید. به تفت دادن ادامه دهید تا رنگ گوشت عوض شود. رب گوجه را اضافه کنید و 3-4 دقیقه دیگر تفت بدهید. سپس قارچ را به آن اضافه کنید و از روی شعله بردارید.قارچ را خرد کنید و در تابه روغن بریزید. وقتی آب قارچ کشیده شد کمی آن را تفت بدهید تا پخته شود و آن را کنار بگذارید. پیاز را کاملاً ریز کنید و در روغن تفت بدهید تا شروع به طلایی شدن کند. سپس کمی زردچوبه به آن بزنید. گوشت چرخ کرده را نیز اضافه کنید. نمک، فلفل و کمی دیگر زردچوبه بزنید. به تفت دادن ادامه دهید تا رنگ گوشت عوض شود. رب گوجه را اضافه کنید و 3-4 دقیقه دیگر تفت بدهید. سپس قارچ را به آن اضافه کنید و از روی شعله بردارید.قارچ را خرد کنید و در تابه روغن بریزید. وقتی آب قارچ کشیده شد کمی آن را تفت بدهید تا پخته شود و آن را کنار بگذارید. پیاز را کاملاً ریز کنید و در روغن تفت بدهید تا شروع به طلایی شدن کند. سپس کمی زردچوبه به آن بزنید. گوشت چرخ کرده را نیز اضافه کنید. نمک، فلفل و کمی دیگر زردچوبه بزنید. به تفت دادن ادامه دهید تا رنگ گوشت عوض شود. رب گوجه را اضافه کنید و 3-4 دقیقه دیگر تفت بدهید. سپس قارچ را به آن اضافه کنید و از روی شعله بردارید.قارچ را خرد کنید و در تابه روغن بریزید. وقتی آب قارچ کشیده شد کمی آن را تفت بدهید تا پخته شود و آن را کنار بگذارید. پیاز را کاملاً ریز کنید و در روغن تفت بدهید تا شروع به طلایی شدن کند. سپس کمی زردچوبه به آن بزنید. گوشت چرخ کرده را نیز اضافه کنید. نمک، فلفل و کمی دیگر زردچوبه بزنید. به تفت دادن ادامه دهید تا رنگ گوشت عوض شود. رب گوجه را اضافه کنید و 3-4 دقیقه دیگر تفت بدهید. سپس قارچ را به آن اضافه کنید و از روی شعله بردارید.خوراک گوشت و قارچ با پوره سیب زمینی آماده است. آن را برش بزنید و با سس دلخواه نوش جان کنید."
                },
                { 
                    id:'3',
                    prise:'20000',
                    title : '    و قارچ با ته چین ساده ',
                    imageUrl :require("./../../assets/images/lunch/Tab3/i3.jpg"),
                    body : 'سینه مرغ 300 گرم قارچ 250 گرم   پیاز 1 و نیم عدد   زعفران دم کرده 1 فنجان   برنج 2 پیمانه   ماست 4 قاشق   تخم مرغ 1 عدد   روغن 3 قاشق غذاخور نمک، فلفل و زردچوبه به مقدار کافی زرشک به دلخواه'+"ابتدا، سینه مرغ را همراه با نصف پیاز داخل قابلمه قرار دهید و روی آن آب بریزید، در حدی که حداقل سه سانت روی مرغ را بپوشاند. قدری هم نمک داخل آب بریزید و درب قابلمه را ببندید تا آب جوش بیاید. میتوانید کمی زردچوبه هم اضافه کنید. وقتی آب جوش آمد، شعله را کم کنید و بگذارید 30-40 دقیقه به پخت ادامه دهید.برای این که غذا زودتر آماده شود، همزمان با پخته شدن مرغ ته چین را آماده کنید. برنج را با مقداری آب، نمک و چند قطره روغن روی شعله بگذارید تا زمانی که دور برنج نرم و مغز آن در حد یک نقطه خام باشد. زمان دقیق بسته به نوع برنج تفاوت دارد. ولی برنج های ایرانی معمولاً خیلی زود در حد 7-8 دقیقه به این مرحله میرسند. حال، آن را آبکش کنید و در کاسه ای بریزید. ماست، تخم مرغ، نیمی از زعفران و روغن را با کمی نمک و فلفل در کاسه کوچکی خوب بزنید. سپس آن را به برنج اضافه و مخلوط کنید. کف قابلمه برنج را خوب چرب کنید و بگذارید کمی داغ شود. سپس مخلوط برنج را کف قابلمه بریزید. با یک کفگیر سطح آن را صاف کنید و فشار دهید تا دانه های برنج به هم بچسبند. بعد از چند دقیقه که شروع به جز جز کردن کرد شعله را کم کنید و در قابلمه را بگذارید. ته چین بعد از 45 دقیقه تا 1 ساعت آماده میشود.قارچ را خرد کنید و چند دقیقه در مقدار کمی روغن تفت بدهید.بعد آن را از تابه خارج کنید و کنار بگذارید.وقتی مرغ کاملاً پخت (میتوانید با چنگال تست کنید)، آن را از آب خارج کنید. پیاز را دور بریزید و آب مرغ را برای مصارف دیگر فریز کنید. حال، مرغ را خوب ریش ریش کنید.یک عدد پیاز را رنده کنید و تفت بدهید. کمی زردچوبه هم به آن اضافه کنید.وقتی پیاز شروع به سرخ شدن کرد، مرغ ریش ریش شده را همراه با زعفران باقیمانده به آن اضافه کنید و چند دقیقه تفت بدهید.قارچ را هم به آن اضافه و مخلوط کنید.وقتی ته چین آماده شد بگذارید کمی خنک شود.رشک را روی شعله خیلی کم با اندکی روغن یک دقیقه تفت بدهید.سپس آن را در دیس یا سینی برگردانید و با مرغ و قارچ زعفرانی و زرشک تزیین کنید."
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : ' طرز تهیه خورشت فسنجان با مرغ ',
                    imageUrl :require("./../../assets/images/lunch/Tab3/i4.jpg"),
                    body : 'مرغ 5-6 تکه   پیاز متوسط 1 عدد   گردوی ساییده 400 گرم   رب گوجه 1 قاشق غذاخوری   رب انار 2-3 قاشق غذاخوری   نمک، فلفل، زردچوبه، زعفران به مقدار لازم'+"بتدا مرغ ها را با مقداری نمک، فلفل، زردچوبه و زعفران طعم دار و در روغن سرخ کنید.پیاز را رنده کنید و در روغن تفت بدهید. میتوانید کمی آرد برنج هم در این مرحله اضافه کنید و همراه پیاز تفت بدهید تا خورشت لعاب دار تری داشته باشید.بعد گردوی ساییده را اضافه کنید. برای خوش رنگ تر شدن کمی رب گوجه بریزید. رب انار را هم اضافه کنید (به هر اندازه ای که میخواهید خورشت ترش باشد). بعد کمی تفت بدهید در حدی که بوی خامی رب گرفته شود. اما زیاد تفت ندهید و مراقب باشید گردو نسوزد.حال، آب سرد سرد را به مواد اضافه کنید و بگذارید جوش بیاد. شعله را کم کنید تا خورشت به آرامی بپزد.بعد از حدود ۱ ساعت و نیم  پختن و لعاب دار شدن فسنجان، در صورت تمایل چند عدد آلو بخارا اضافه کنید. بعد مرغ های سرخ شده را به خورشت اضافه کنید تا مرغ ها بپزد و خورشت جا بیافتد. در آخر کمی آب سرد روی خورشت بپاشید تا روغن بیاندازد.خورشت فسنجون با مرغ شما آماده است. آن را همراه با زیتون پرورده، پلو و مخلفات دلخواه سرو کنید."
                },
                {
                    id:'5',
                    prise:'70000',
                    title : ' جوجه ترش ',
                    imageUrl :require("./../../assets/images/lunch/Tab1/i5.jpg"),
                    body :"فیله مرغ 500 گرم  رب انار 2 قاشق غذاخوری   پیاز 1 عدد   کره 50 گرم   گردوی خرد شده 3 قاشق غذاخوری   زعفران دم کرده 1 قاشق غذاخوری   ماست 2 قاشق غذاخوری   نمک و فلفل به مقدار کافی"+"رای تهیه جوجه کباب ترش شمالی ابتدا فیله‌های مرغ را خرد کنید و به صورت تکه های کوچک یا متوسط در بیاورید. سپس فیله‌های خرد شده را داخل یک کاسه بریزید.پیاز را به شکل خیلی ریز خرد کنید و به کاسه مرغ خرد شده بیافزایید. در ظرف دیگری ماست و زعفران را به طور جداگانه باهم مخلوط کنید و بعد به فیله‌ها اضافه کنید. بگذاید کره در مایکروفر یا روی حرارت خیلی ملایم آب شود. حال، گردو را چرخ کرده و یا آسیاب کنید و به مواد قبلی اضافه نمایید. رب انار و کره آب شده را نیز به مواد اضافه و خوب با هم مخلوط کنید. بهتر است نمک و فلفل را برای آخرین مرحله بگذارید و یک نوک انگشت از سس تهیه شده را بچشید و اگر نیاز هست مقدار ادویه ها را تنظیم کنیدبگذارید مرغ در سس ترش به مدت 3-4 ساعت یا بیشتر داخل یخچال بماند تا خوب مزه‌دار شود.حالا جوجه‌های مزه‌دار شده را به سیخ بکشید و روی منقل یا داخل تابه گریل بچینید و کباب کنید. جوجه کباب ترش یا جوجه ترش شما آماده است. می‌توانید مثل دیگر انواع کباب، آن را همراه با برنج یا نان سرو کنید. در کنار جوجه ترش میتوانید از انواع ترشی و ماست هم استفاده کنید."


                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'بال مرغ ترد ',
                    imageUrl :require("./../../assets/images/lunch/Tab1/i6.jpg"),
                    body :"بال مرغ 900 گرم   نمک 1 قاشق چایخوری   فلفل 1/2 قاشق چایخوری   پودر سیر 1/2 قاشق چایخوری"+" بال‌های مرغ را آماده کنید. اول نوک آنها را ببرید و جدا کنید. سپس آنها را از وسط نصف کنید. از نوک بال‌ها در این غذا استفاده نخواهد شد اما می‌توانید از آنها برای تهیه سوپ استفاده کنید یک قابلمه آب را روی شعله قرار دهید و بگذارید آب به جوش بیاید. سپس بال ها را داخل آن بیاندازید و بگذارید 6-7 دقیقه در آب جوش پخته شوند. این کار باعث میشود مقداری از چربی مرغ به آب منتقل شود و در نتیجه بال مرغ شما تردتر شود. پس از آن بال ها را به یک توری فلزی یا یک دیس منتقل کنید و طوری بچینید که خشک شوند. فر را با دمای 230 درجه سانتیگراد روشن کنید تا گرم شود. سینی فر (ترجیحاً سینی شیاردار) را نیز با مقداری روغن چرب کنید. در کاسه کوچکی، نمک، فلفل برتر و پودر سیر برتر را با هم مخلوط کنید."

                },
            ]
        })
    }

    render(){
        return(
            <Container  >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../../assets/images/l.jpg')} >
    <Content    >
       <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:1,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})