import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class Breackfast extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                     prise:'85000',
                    title : '   سوپ هویج و اسفناج ',
                    prise:'85000',
                    imageUrl :require('./../../assets/images/dinner/i2.jpg'),
                    body : 'روش تهیه: عدس را در آب بریزید در حد نیم پز شدن بپزید. هویج را نگینی خرد و به آن اضافه کنید. وقتی کاملا پخته شدند اسفناج خردکرده را به آن اضافه کنید. در این مرحله حدود ۸ دقیقه سوپ را با در باز بپزید. این کار باعث می شود اسفناج رنگ بهتری داشته باشد. شیر را همراه عصاره مرغ، نمک و فلفل اضافه کنید و هر از گاهی سوپ را هم بزنید. رشته سوپی و آبلیمو را در آخر اضافه کنید ودرحدی که رشته بپزد و سوپ جا بیفتد آن را بپزید. پس از کشیدن سوپ در ظرف مورد نظر آن را با چند حلقه قارچ تزیین کنید. نکته های آشپزی: پس از ریختن اسفناج و شیر، در قابلمه را نگذارید. نکته های سلامت: در اسفناج می توانید مقادیر زیادی آهن، ید، لسیتین، کلروفیل، کاروتن، اسید اگزالیک و اسید ارسنیک پیدا کنید که تمام آنها املاح معدنی مفید برای بدن محسوب می شوند.'+"مواد لازم برای ۴ نفر هویج: ۲ عدد اسفناج تازه: ۱۰۰ گرم شیر: یک پیمانه رشته سوپی: یک چهارم پیمانه عدس: یک پیمانه نمک و فلفل: به میزان لازم عصاره مرغ: یک عدد آبلیمو: ۲ قاشق غذاخوری قارچ: برای تزیین سوپ کره: مقدارکمی به دلخواه"
                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : "کوفته دست به گردن",
                    imageUrl :require('./../../assets/images/dinner/i1.jpg'),
                    body : 'کوفته دست به گرد روش تهیه: برنج را بشویید همراه نمک و کمی زردچوبه با مقداری آب به اندازه ای که فقط سطح برنج را بپوشاند، بپزید تا مانند کته آب آن تمام شود. پیاز را در یک قابلمه بزرگ تر از حد معمول، خرد کنید و با روغن تفت دهید سپس رب گوجه فرنگی، زردچوبه، نمک و فلفل را اضافه کنید و حدود ۶ لیوان آب بریزید و بگذارید بجوشد. گوشت را همراه سبزی خردشده، برنج پخته شده، نمک و فلفل و یک عدد تخم مرغ مخلوط کنید و خوب ورز دهید یا در دستگاه غذاساز چند چرخ دهید. بعد از اینکه آب پیاز داغ و رب جوش آمد، از مایع به اندازه یک نارنگی بردارید، در دست گرد کنید و در آب جوش بیندازید. بعد از اینکه هر کوفته کمی خودش را گرفت آن را در آب بغلتانید. کوفته ها بعد از نیم ساعت پخت حاضر می شوند و می توانید آنها را سرو کنید. نکته های آشپزی: نمک آب کوفته همیشه باید کمتر از حد معمول باشد چون بعد از جوشیدن شور می شود. به چاشنی آب کوفته می توانید پودر لیموعمانی و پودر تخم گشنیز اضافه کنید. نکته های سلامت: پیاز که از دسته سبزیجات است به دلیل خواص درمانی اش بسیار مورد توجه قرار می گیرد و البته همه ما باید خوشحال باشیم که این نوع از سبزی به عنوان چاشنی در همه غذاها کاربرد دارد. آیا می دانستید پیاز با بهره مندی از عناصر سولفوردار موجود در خود مانع چسبندگی پلاکت ها می شود و از لخته شدن خون جلوگیری می کند'+"مواد لازم برای ۴ نفر برنج نیم دانه: یک پیمانه پیاز درشت: یک عدد رب گوجه فرنگی: ۲ قاشق غذاخوری  روغن: به میزان لازم  گوشت چرخ کرده: ۲۰۰ گرم  سبزی کوفته: ۲۰۰ گرم  تخم مرغ: یک عدد  نمک، فلفل، زردچوبه:"
                },
                { 
                    id:'3',
                    prise:'20000',
                    title : "پاکوره",
                    imageUrl :require('./../../assets/images/dinner/i3.jpg'),
                    body : 'روش تهیه: سیب زمینی ها را بشویید و با پوست بپزید، سپس پوستش را بگیرید و رنده کنید. آرد گندم را در یک لیوان آب سرد حل کنید. مراقب باشید آب را کم کم اضافه کنید تا گلوله نشود. تخم مرغ ها را به محلول آرد و آب اضافه و خوب مخلوط کنید و به مدت ۱۰ دقیقه کنار بگذارید. سبزی ها را با سیب زمینی مخلوط و نمک، فلفل، زردچوبه و ادویه را اضافه کنید و خوب ورز دهید تا مایه یکدست شود. تمرهندی را با یک لیوان آب ولرم مخلوط کنید و از صافی بگذرانید. ۴ قاشق از شیره تمرهندی را همراه مخلوط سیب زمینی به مخلوط آرد و آب و تخم مرغ اضافه کنید و خوب هم بزنید. از مواد با قاشق غذاخوری بردارید و در روغن داغ سرخ کنید. باقیمانده شیره تمرهندی را با کمی روغن و فلفل قرمز تند و نمک بجوشانید تا سس غلیظی درست شود و همراه پاکوره سرو کنید. نکته آشپزی: می توانید از یک عدد فلفل تند خرد شده در این غذا استفاده کنید. نکته سلامت: تمرهندی دارای مقدار زیادی کاروتن، ویتامین C و برخی فلاونوییدهاست، بنابراین با شروع فصل سرما و بروز بیماری هایی همچون سرماخوردگی، می توانید برای تسریع در امر درمان تمرهندی را در فاصله میان وعده های غذایی میل کنید.'+"مواد لازم برای ۴ نفر سیب زمینی: ۴ عدد  آرد گندم: ۲ پیمانه تخم مرغ: ۴ عدد تره و جعفری خردشده: ۲۰۰ گرم تمرهندی: یک بسته کوچک  نمک، فلفل، زردچوبه و ادویه دلخواه: به میزان لازم  روغن سرخ کردنی: به میزان لازم"
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : 'خوراک بامیه',
                    imageUrl :require('./../../assets/images/dinner/i4.jpg'),
                    body : 'واد لازم برای ۴ نفر بامیه: ۵۰۰ گرم پیاز درشت: یک عدد سیر پوره شده: یک عدد گوجه فرنگی: ۲ عدد رب گوجه فرنگی: یک قاشق سوپ خوری روغن گیاهی: ۳ قاشق سوپ خور نمک و فلفل: به میزان لازم آب: یک پیمانه آبلیمو: یک قاشق سوپ خوری'+" روش تهیه: بامیه ها را بشویید و تمیز کنید. کمی آنها را در روغن سرخ کنید سپس آنها را دور تا دور ظرف مناسب و گودی بچینید. پیاز را نگینی خرد و با سیر پوره شده مخلوط کنید. آنها را کمی در روغن تفت دهید و وسط ظرف بریزید و رویشان را با گوجه فرنگی رنده شده بپوشانید. رب گوجه فرنگی را با آب ولرم مخلوط کنید و همراه نمک و فلفل روی بامیه ها بریزید. در ظرف را بگذارید و روی شعله ملایم قرار دهید تا جا بیفتد و سس آن غلیظ شود. در آخر طبخ آبلیمو را اضافه کنید. نکته آشپزی:برای اینکه بامیه ها له نشوند و شکلشان حفظ شود بهتر است فقط کمی از سر آنها را با چاقو بگیرید.  می توانید این غذا را در فر با حرارت ۱۲۰ درجه سانتی گراد به مدت یک ساعت روی پنجره اول از پایین فر هم بپزید. نکته سلامت: طبیعت بامیه سرد است و علاوه بر استفاده غذایی، به نوعی ملین مزاج نیز هست. در ضمن بامیه غدد پروستات را تقویت می کند"
                },
                {
                    id:'5',
                    prise:'70000',
                    title : 'کوکوی عدس ',
                    imageUrl :require('./../../assets/images/dinner/i5.jpg'),
                    body : 'روش تهیه: عدس را خیس کنید و بعد از آبکشی آن را با آب بپزید تا جایی که آبش کاملا به خوردش رفته و ته بکشد. سپس آن را با گوشتکوب یا با دستگاه غذاساز خوب له کنید. عدس کوبیده و له شده را در یخچال بگذارید تا کاملا سرد و سفت شود. بقیه مواد را مانند مایه همه کوکوها با هم مخلوط و به عدس اضافه کنید و خوب هم بزنید تا مواد منسجم شود. اگر مایه در دست قابل شکل گرفتن بود، می توانید سرخش کنید ولی اگر شل بود مقدار بیشتری پودر نان به آن اضافه کنید تا هنگام سرخ شدن وا نرود. از مایه به اندازه دلخواه بردارید و در روغن داغ سرخ کنی   نکته آشپزی: دقت داشته باشید روغن این غذا نباید زیاد باشد. این کوکوی خوشمزه را به شما توصیه می کنم فقط باید در انسجام مواد دقت کنید. بهتر است ابتدا یکی از کوکو ها را در روغن سرخ کنید تا اگر وا رفت بتوانید پودر نان را به بقیه مواد اضافه کنید.   نکته سلامت: میزان آهن عدس بالاست و البته چربی آن پایین. عدس باعث کاهش قند و چربی خون می شود. برای جذب هر چه بهتر عدس در بدن بهتر است آن را همراه موادغذایی حاوی ویتامین C مانند لیموترش استفاده کنید.'
                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'اش کدو بادمجان   ',
                    imageUrl :require('./../../assets/images/dinner/i6.jpg'),
                    
                    body : 'مواد لازم برای ۴ نفر بادمجان قلمی: ۵۰۰ گرم کدو سبز: ۵۰۰ گرم پیاز متوسط: یک عدد سیر: ۵ حبه گوجه فرنگی: ۵۰۰ گرم کشک: به میزان لازم نمک، فلفل و زردچوبه: به میزان لازم نعناع خشک: ۲ قاشق سوپ خوری روغن مایع: به میزان لازم'+"روش تهیه: بادمجان وکدو را پوست بگیرید و نگینی خرد کنید. پیاز را ریز خرد و سرخ کنید. سیر را نیز اضافه کنید و کمی تفت دهید سپس بادمجان وکدو را بریزید و خوب سرخ کنید. نمک، فلفل و زردچوبه را اضافه کنید. گوجه فرنگی را رنده و همراه نعناع به مواد اضافه کنید سپس کشک را رقیق کنید و داخل مواد بریزید و بگذارید بپزد و همراه نان میل کنید.  نکته آشپزی: به جای کشک رقیق می توانید از آب استفاده کنید. نکته سلامت: کدو یکی از منابع غنی ویتامین A است. ضمن اینکه از موادمغذی دیگری نیز بهره مند است که مانع بروز امراض قلبی می شوند. فراموش نکنید مصرف روزانه ۱۵۰ گرم کدو، فیبر مورد نیاز هر روز بدن شما را تامین می کند."
                },
            ]
        })
    }

    render(){
        return(
            <Container >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../../assets/images/l.jpg')} >
    <Content     >
        
    <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
        
       

       
       
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:.5,
    //   width:200,
    //   height:150,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})