import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class BreackfastTab2 extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                     prise:'85000',
                    title : ' طرز تهیه خورشت قیمه با قارچ ',
                    prise:'85000',
                    imageUrl :require('./../../assets/images/dinner/tab2/i1.jpg'),
                    body :' قارچ300 گرم   پودر لیمو عمانی1 قاشق روغن150 گرم   سیب زمینی500 گرم لپه1/2 پیمانه   آبلیمو1 قاشق پیاز داغ2 قاشق   گوجه فرنگی200 گرم رب گوجه فرنگی1 قاشق   نمک و فلفلبه مقدار لازم'+"قیمه غذایی بسیار خوشمزه و اصیل است. طبخ قیمه در شهرهای مختلف به شیوه‌هایی متفاوت انجام می‌شود. این نوع قیمه به دلیل وجود قارچ هم خوشمزه است و هم کاملا گیاهی و برای افرادی که از رژیم غذایی پیروی می‌کنند گزینه بسیار مناسبی است.  ابتدا در ظرفی مناسب مقداری روغن داغ کنید و پیازها را در آن کاملا تفت دهید. سپس لپه‌ها راخوب پاک کنید سپس بشویید و از آبکش رد کنید و به پیاز داغ اضافه نمایید و خوب سرخ کنید. این کار به خاطر جلوگیری از له شدن لپه حین جا افتادن خوشت است. حالا نمک، فلفل، زردچوبه، زعفران آب شده و آرد را به آن اضافه کرده و قدری تفت دهید تا عطر آن‌ها به خوبی به مشام برسد. استفاده از آرد تنها به دلیل غلظت و لعاب خورشت است. چون در این دستور غذایی از آب گوشت یا حتی آب مرغ استفاده نمیشود و کاملا مورد طبع طرفداران گیاهخواری است. حالا برای خوش رنگ شدن خورشت کمی به آن رب اضافه کرده و قدری تفت دهید. مواد خورشت تقریبا آماده است با 2 لیوان آبجوش اجازه دهید غذا خوب جا بیفتد. فراموش نکنید که 3 عدد گوجه فرنگی رسیده را پوست بگیرید و درون خورشت بیندازید تا طعم آن را فوق العاده کند.   در ظرفی جداگانه کمی آبلیمو بجوشانید و قارچ‌ها را به آن اضافه کرده و نمک هم بزنید تا خوب طعم‌دار شود. دلیل اضافه کردن آبلیمو علاوه بر طعم دار شدن این است که قارچ سیاه نشود و ظاهر خود را در خورشت حفظ کند. قارچ را 30 دقیقه مانده به جا افتادن غذا به همراه لیمو عمانی به خورشت اضافه کنید تا مزه بگیرد. سیب زمینی‌ها را خلال کرده و سرخ کنید و به همراه غذا سرو نمایید. "
                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : 'طرز تهیه خوراک مرغ ویژه',
                    imageUrl :require('./../../assets/images/dinner/tab2/i2.jpg'),
                    body : 'روغنبه مقدار دلخواه   فیله مرغ10 تکه پیاز2 عدد   قارچ500 گرم رب گوجه فرنگی2 قاشق   آب مرغ2 پیمانه عدس1 پیمانه   زیتون سیاه1 پیمانه زیتون سبز1 پیمانه   پونه کوهی2 قاشق جعفری خرد شده2 قاشق   گوجه فرنگی2 عدد'+"برای تهیه این غذای خوشمزه فیله ی مرغ بسیار مناسب است. استفاده از عدس قرمز طعم بهتری به این غذا میدهد البته باید حداقل از 4 ساعت قبل آن را در آب خیس کنید. در ضمن هنگام پاک کردن این مدل عدس بسیار دقت کنید. چون احتمال اشتباه گرفتن سنگریزه ها با دانه های عدس وجود دارد. سعی کنید از روغن کمتری استفاده کنید تا ارزش غذایی آن حفظ شود. پس برای سرخ کردن مرغ، درون یک قابلمه ی تفلون روغن اسپری کنید و به این شکل آن را چرب کن   فیله های مرغ را در قابلمه ی مورد نظر تفت دهید تا قهوه ای رنگ شود، هنگام تفت دادن آن‌ها را برگردانید تا تمام قسمت ها سرخ شوند. سپس آن‌ها را از قابلمه خارج کنید. پیاز و سیر را پوست بگیرید و خلال کنید. قارچ ها را تمیز کرده، ورقه ای کنید. گوجه فرنگی را شسته و ریز کنید و در همان قابلمه که مرغ ها را تفت دادید، پیاز، قارچ و سیر را  بریزید و تا زمان نرم شدن پیاز آن‌ها را هم بزنید، سپس گوجه فرنگی ریز شده، رب گوجه فرنگی، آب مرغ و عدس قرمز را درون قابلمه بریزید. اجازه دهید آب مرغ، جوش بیاید و چند جوش بخورد. سپس مرغ را به مواد اضافه کنید و درب قابلمه را ببندید و صبر کنید تا به مدت 30 دقیقه آرام بجوشد و مرغ نرم شود. بعد از پخته شدن مرغ و کم شدن آب، زیتون سیاه و زیتون سبز خرد شده را به همراه اورگانو یا همان پونه ی کوهی  و جعفری به مواد بیفزایید. سه دقیقه تفت دهید و در ظرف مناسب سرو کنید. خوراک مرغ ویژه را میتوانید به مدت 2 روز در یخچال در ظرف در بسته نگهداری کنید. در صورتی که از قارچ های ریز استفاده میکنید بهتر است آنها را ورقه ای نکنید و به همان شکل کامل و درسته مورد استفاده قرار دهید. "
                },
                { 
                    id:'3',
                    prise:'20000',
                    title : 'سیب زمینی تنوری با قارچ و ماست ',
                    imageUrl :require('./../../assets/images/dinner/tab2/i3.jpg'),
                    body : 'آماده کردن مواد برای تهیه سیب زمینی تنوری با قارچ و ماست: ۱- وزن هر سیب زمینی حدود ۲۳۰ گرم باشد. پوست سیب زمینی ها رو تمیز بشویید. ۲- قارچ ها رو خرد کنید. ۳- از پنیر چدار سفید رنده شده استفاده کنید. ۴- پیازچه رو به شکل حلقه های نازک برش بزنید.'+"از قبل فر رو با حرارت ۲۳۰ درجه سانتی گراد گرم کنید. سیب زمینی ها رو در سینی فر گذاشته و تا پوست آن ها برشته و سیب زمینی ها پخته و نرم شوند، برای حدود ۴۵ تا ۵۰ دقیقه بپزید.روغن رو در ماهیتابه ای روی حرارت متوسط رو به بالا گرم کنید. قارچ رو اضافه کنید و برای حدود ۲ دقیقه تا قهوه ای رنگ بشه، تفت بدین. به قارچ ها کمی نمک و فلفل سیاه بزنید.سیب زمینی ها رو از بالا شکاف بزنید و با کمی فشار اون رو باز کنید. قارچ های تفت داده شده و پنیر چدار رو بین سیب زمینی ها تقسیم کنید. روی هر سیب زمینی مقداری ماست بذارید و روی اون ها پیازچه خرد شده بریزید."
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : 'طرز تهیه کتلت رژیمی خوشمزه با سبزیجات',
                    imageUrl :require('./../../assets/images/dinner/tab2/i4.jpg'),
                    body : 'مواد لازم  ریحان و مرزه خشک شده: یک قاشق غذاخوری پودر شده روغن کنجد: برای سرخ کردن نمک، فلفل، زردچوبه و ادویه: به میزان لازم پیاز: 2 عدد پودر سوخاری: 2 قاشق غذاخوری سیب زمینی: 4 عدد متوسط'+"در دستور طرز تهیه کتلت رژیمی که در این مطلب ارائه می دهیم سعی شده، استفاده از مواد کلسترول دار را به حداقل برسانیم. برای سرخ کردن کتلت نیز از روغن کنجد استفاده می کنیم. روغن کنجد ضمن داشتن خواص فراوان، روغن سالم و مناسبی برای بیماران می باشد.  برای شروع پخت کتلت رژیمی, ابتدا سیب زمینی ها را بشویید و پوست بگیرید. در ادامه این سیب زمینی های پوست گرفته شده را رنده کنید. پیاز را نیز رنده کنید و به سیب زمینی اضافه کنید و هم بزنید.  سیب زمینی رنده شده   توجه داشته باشید که برای تهیه کتلت عمل مخلوط کردن بسیار مهم است. چون در این فرآیند مواد یک دست می شود و بافت منظم پیدا می کند. در مرحله بعدی طرز تهیه کتلت رژیمی نوبت به نمک، فلفل و ادویه می رسد. بعد از اضافه کردن ادویه جات، مواد را با هم خوب مخلوط کنید تا ادویه های اضافه شده جذب پیاز و سیب زمینی شوند.   میکی سیب زمینی رنده شده و ادویه   حالا از سبزی های معطر مانند ریحان و مرزه خشک در کتلت استفاده کنید. طعم فوق العاده این سبزی های معطر در کتلت رژیمی معجزه می کند. در ادامه پودر سوخاری را به سایر مواد اضافه کنید.   میکس مواد کتلت همه مواد را با هم مخلوط کنید و مخلوط را به درستی ورز دهید. تابه ای مناسب برای سرخ کردن کتلت انتخاب کنید. روغن کنجد در آن بریزید. صبر کنید تا روغن داغ شود. در این زمان انتظار، گلوله کتلت خود را آماده کنید. به اندازه یک اسکوپ از مواد برداشته و در کف دست آن را پهن و یک دست کنید.  این گلوله های کتلتی را در روغن قرار دهید. بعد از 3 دقیقه طرف دیگر کتلت را نیز برگردانید تا سرخ شود.  مراحل تهیه کتلت رژیمی  کتلت رژیمی شما در این مرحله آماده خوردن می شود. این کتلت ها را می توان مانند فلافل با سایر مخلفات از جمله کاهو، خیار شور، گوجه و سس نوش جان کرد."
                },
                {
                    id:'5',
                    prise:'70000',
                    title : 'طرز تهیه آلو اسفناج با مرغ یک خورش ایرانی دلپذیر و لذیذ ',
                    imageUrl :require('./../../assets/images/dinner/tab2/i5.jpg'),
                    body : 'مرغ: نصف یک مرغ کامل روغن: یک قاشق غذاخوری آلو بخارا: به میزان لازم آب: دو لیوان سیر خرد شده: 2 حبه زردچوبه، نمک، فلفل و ادویه: به میزان لازم پیاز: یک عدد اسفناج: یک کیلوگرم'+"خورشت آلو اسفناج از خورشت های خوشمزه با خواص فراوان است که می توان با گوشت گوسفندی و مرغ تهیه کرد. برای شروع دستور تهیه آلو اسفناج با مرغ, ابتدا باید نصف مرغ را تهیه کنید و آن را بشویید. سپس به تکه های کوچک تقسیم کنید. تکه های مرغ را داخل آبکش بریزید. در قابلمه روغن بریزید و منتظر بمانید تا روغن داغ شود. پیازهای خرد شده را در روغن تفت دهید. پیاز سرخ شده  بعد از طلایی شدن پیازهای خرد شده می توانید سیر را به آن اضافه کنید. بعد از تفت خوردن سیر و پیاز، نمک، فلفل و زردچوبه را به آن اضافه کنید. بعد از تفت خوردن زردچوبه و ادویه، تکه های مرغ را بریزید و تفت دهید. حالا درب ظرف را قرار دهید و شعله اجاق گاز را کم کنید تا مرغ آب بیندازد. اسفناج را بشویید و اجازه دهید تا آب اسفناج کشیده شود. بعد از کشیده شدن آب اسفناج، اسفناج را خرد کنید.  افناج جهت تهیه خورش آلو اسفناجدر مرحله بعدی طرز تهیه آلو اسفناج با مرغ, اسفناج های خرد شده را در ظرفی ریخته و اجازه دهید با حرارت ملایم پخته شود. وقتی آب اسفناج گرفته شد، اسفناج را به مرغ اضافه کنید. توجه داشته باشید برای پخت اسفناج هیچ آبی به آن اضافه نکنید. اسفناج آب می اندازد و تا تبخیر آب نیز پخته می شود. خورشت آلو اسفناج با مرغ در ادامه آلوها را به همراه دو لیوان آب به غذا اضافه کنید. اجازه دهید تا با شعله کم غذا بپزد و جا بیفتد. اگر تمایل داشته باشید برای چاشنی غذا می توانید از آبلیمو یا آبغوره استفاده کنید."
                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'طرز تهیه خورش گل کلم با طعم فوق العاده عالی ',
                    imageUrl :require('./../../assets/images/dinner/tab2/i6.jpg'),
                    body : 'مواد لازم  پیاز سرخ کرده: 3 قاشق سوپ خوری  گوشت ماهیچه یا سردست بدون استخوان 500 گرم و با استخوان 750 گرم  آب لیمو: 3 تا 4 قاشق سوپ خوری  زعفران ساییده: یک قاشق چای خوری  شکر: یک تا دو قاشق سوپ خوری  نمک و فلفل: به قدر کافی  گل کلم: یک عدد معادل یک کیلو گرم'+"برای تهیه خورش کلم، گوشت را به قطعات کوچک تقسیم کنید. منظور از قطعات کوچک اندازه ای معادل یک گردو است. مقداری روغن در ظرف مناسبی بریزید و بعد از داغ شدن روغن پیاز را به آن اضافه کنید. قطعات گوشت آماده شده را به این پیاز سرخ شده و طلایی اضافه کنید. در ظرف را ببندید و آن را روی حرارت ملایم قرار دهید. آن را به هم بزنید تا هم آب گوشت کشیده شود و هم به خوبی تفت داده شود.  مراحل تهیه خورش گل کلم  در مرحله بعدی طرز تهیه خورش گل کلم خوشمزه، باید 2 لیوان آب به گوشت اضافه کنید. منتظر بمانید تا گوشت بپزد. این قطعات کوچک شده به پخت سریع گوشت کمک خواهد کرد. اگر بعد از خشک شدن آب، گوشت هنوز نپخته بود می توانید مقدار دیگری آب گرم به آن اضافه کنید. آن گاه در همین مرحله شکر، آبلیمو و زعفران حل شده را در آب جوش ریخته و در ادامه رب گوجه فرنگی، کمی نمک و فلفل به آن اضافه کنید. ابتدا گل کلم را خوب بشویید. گل های کلم را نیز به قطعات کوچک تقسیم کنید. خرد کردن گل کلم معادل اندازه گردو برای گل کلم کفایت می کند. این قطعات گل کلم را به گوشت در حال پخت اضافه کنید. مواد را کاملا با هم مخلوط کنید.   مراحل تهیه خورش گل کلم  چاشنی و نمک غذا را بچشید و در صورت نیاز نمک و فلفل بیشتر به آن اضافه کنید. اگر میزان شکر را افزایش دهید، میزان شیرینی این خورش بیشتر می شود و اگر آبلیمو را زیاد کنید آن را ترش خواهید کرد. منتظر بمانید تا این خورش خوشمزه جا بیفتد. توجه داشته باشید که گل کلم ها نباید له شوند و خورشت شما نباید آبکی باشد."
                },
            ]
        })
    }

    render(){
        return(
            <Container  >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../../assets/images/l.jpg')} >
    <Content    >
       <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:1,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})