import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class BreackfastTab3s extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                     prise:'85000',
                    title : ' ساق مرغ در فر ',
                    prise:'85000',
                    imageUrl :require('./../../assets/images/lunch/Tab3/i1.jpg'),
                    body : 'ساق مرغ 14 عدد  روغن زیتون تصفیه شده 1/4 پیمانه  سیر رنده شده یا له شده 4 حبه  جعفری خرد شده 4 قاشق غذاخوری  آبلیموی تازه 3 قاشق غذاخوری  سس خردل 2 قاشق غذاخوری  نمک 1 قاشق غذاخوری  فلفل سیاه 1/2 قاشق چایخوری'+"اول از همه سیر را رنده و جعفری را خیلی ریز خرد کنید. بعد روغن زیتون را در کاسه کوچکی بریزید. سیر، جعفری، آبلیمو، خردل، نمک و فلفل را به آن اضافه کنید و خوب هم بزنید.ساق های مرغ را در کاسه بزرگی قرار دهید. سس را روی آن بریزید و با دست زیر و رو کنید تا همه ساق ها خوب به آن آغشته شوند. سعی کنید کمید از سس را زیر پوست مرغ فشار دهید تا ساق ها خوب طعم دار شوند. سپس روی کاسه را با سلفون بپوشانید و 6 ساعت یا از شب تا صبح بگذارید به همان حال بماند.فر را از قبل با دمای 200 درجه سانتیگراد روشن کنید تا گرم شود. کف سینی فر دارای خطوط برجسته (مثل تابه گریل) فویل آلومینیومی بکشید یا از روکش سیلیکونی سینی فر استفاده کنید. تا فر گرم میشود، ساق ها را از یخچال خارج کنید و روی فویل بچینید تا به دمای اتاق برسند. سمت پوست دار ساق باید روی سینی قرار بگیرد.اگر از سس چیزی در کاسه باقی مانده آن را روی ساق مرغ ها بمالید. سینی را 25 دقیقه در طبقه وسط فر قرار دهید. بعد از این مدت به کمک انبر یا دو چنگال ساق ها را در سینی بچرخانید و سینی را 25 دقیقه دیگر در فر بگذارید. برای برشته شدن پوست مرغ میتوانید در آخر یکی دو دقیقه شعله بالای فر را روشن کنید.وقتی ساق مرغ در فر پخته شد سینی را خارج کنید و روی ساقها جعفری تازه خرد شده بریزید غذا را سرو کنید.اه دیگر آغشته کردن مرغ به سس این است که آن را همراه با سس داخل کیسه زیپ داری بریزید. زیپ را ببندید و کیسه را خوب تکان دهید سپس بگذارید 6 ساعت بماند."
                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : 'مرغ بریان در فر',
                    imageUrl :require('./../../assets/images/dinner/tab3/i2.jpg'),
                    body : 'مواد لازم: مرغ:۱عدد درسته،زعفران دم کرده:۱ استکان کوچک،آبلیمو دو قاشق غذاخوری،سیر دوحبه،فلفل دلمه ای ۱ عدد کوچک،گوجه:۱ عدد، طرز تهیه:  ابتدا فر را با حداکثر دما روشن کنید و بگذارید داخل فر کاملا داغ شود . مرغ را بشوئید، درون شکم مرغ را خالی و تمیز کنید و ۱۵ دقیقه داخل آب نسبتا گرم قرار دهید تا خونابه داخل مرغ کاملا خارج شود . بعد گردن و قسمتهای اضافی سر بال مرغ را با قیچی بچینید. ۱ استکان زعفران، ادویه و آبلیمو را با هم مخلوط کنید و هم بزنید تا سس یکدستی حاصل شود . مرغ را از آب در بیاورید و داخل سبد بگذارید تا آب آن چیده شود . دقت کنید که مرغ کاملا خشک شود. تمام سطح مرغ و داخل شکم آنرا با نمک آغشته کنید و بعد با قلمو سطح و شکم مرغ را با سس آبلیمو بپوشانید. این کار را چند مرتبه تکرار کنید تا رنگ و بوی مرغ کاملا عوض شود .   مرغ مزه دار شده را ۱۰ دقیقه داخل یخچال بگذارید و در این مدت چندین مرتبه از سس آبلیمو روی تمام سطح مرغ و داخل شکم آن بریزید.   گوجه را به دو نیم تقسیم کنید و فلفل دلمه ای و سیر را به قطعات درشت خرد کنید .   بعد از اینکه مرغ کاملا مزه دار شد و رنگ آن تغییر کرد، آنرا از یخچال خارج کنید، مرغ را سرو ته کنید تا چیزی از سس داخل شکم آن باقی نماند و موجب تلخی آن نشود .   داخل شکم مرغ را با گوجه و مقداری از سیر و فلفل دلمه ای خرد شده پر کنید .   با نوک چاقو زیر پوست مرغ را کمی بخراشید تا بتوانید مقداری از سس، فلفل و سیر خرد شده را در آن جای دهید. زیر پوست مرغ را در قسمتهای مختلف با بقیه فلفل و سیر خرد شده و مقدار کمی از سس پر کنید .   بعد به روش زیر انتهایی ترین قسمت یکی از پاهای مرغ را یک شکاف ۴ سانتی ایجاد کنید و پای دیگر مرغ را از داخل شکاف رد کنید.   ( این عمل برای ثابت نگه داشتن پاهای مرغ در حین طبخ است )   وقتی پای مرغ ثابت شد، دو تکه فویل را دور قسمت های انتهای پای مرغ بپیچید تا در اثر حرارت مستقیم نسوزند . (قسمتهای انتهایی پای مرغ فاقد گوشت و چربی هستند و در اثر حرارت خیلی زود میسوزند)  و بعد از انجام تمام مراحل فوق به کمک یک تکه نخ ضخیم مرغ را جمع و کاملا ثابت کنید :  دوباره مقداری از سس آبلیمو روی تمام سطح مرغ بریزید و مرغ را به سیخ جوجه گردان دستگاه فر بکشید و داخل محل مخصوص قرار دهید .  شعله گریل را روشن کنید و سیخ را در حالت گردان تنظیم کنید .  هر ۱۵ دقیقه یکبار، با قلموی آشپزخانه سطح روی مرغ را با مخلوط کره ذوب شده و ۱ قاشق غذا خوری زعفران دم شده پوشش دهید تا هم خشک نشود و هم کاملا طعم دار و ترد شود .  برای طبخ کامل مرغ با این روش حدودا ۳ ساعت زمان لازم است که این زمان بسته به نوع مرغ میتواند کمتر یا بیشتر باشد. میتوانید با فرو کردن چنگال یا نوک کارد داخل گوشت مرغ از پختن آن مطمئن شوید.  و بعد به آرامی مرغ را از داخل سیخ خارج کنید، نخ دور آن و فویل ها را جدا کنید و در ظرف مناسب سرو کنید. بهتر است مرغ بریان را بلافاصله بعد از خارج کردن از فر سرو کنید تا حالت چرمی و کشدار پیدا نکند. به همین منظور ظرف سرو و مخلفات آن را قبل از خارج کردن مرغ از فر آماده کنید '
                },
                { 
                    id:'3',
                    prise:'20000',
                    title : ' مرغ هندی ',
                    imageUrl :require('./../../assets/images/dinner/tab3/i3.jpg'),
                    body : 'مواد لازم: مرغ خرد شده ١ عدد ، پیاز متوسط ٣ عدد ، گوجه متوسط ٣ عدد ، سیر ٣ حبه ، جعفری خرد شده مقداری ، روغن مایع نیم لیوان ، نمک + دارچین + دونه های زیره ١ قاشق کوچک ، پودر زیره ١ قاشق کوچک ، ادویه هندی ” کاری ” (بهارات)١ قاشق غ ، زرد چوبه ١ قاشق چ ، ماست نیم لیوان طرز تهیه:   مرغ رو توی روغن کمی تفت داده و بعد زیره و پودر زیره و دارچین و ماست و سیر و ادویه رو بهش اضافه کنید.سپس زرد چوبه رو هم به همین ترتیب اضافه کرده و هم بزنید   حدود ۵ دقیقه هم میزنید و بعد ١ لیوان و نیم اب و نمک را به آن اضافه کرده و در ظرف رو بذارید تا وقتی که مرغ نیم پخت شود.سپس  گوجه و پیازی که درشت خرد شده و جعفری رو بریزید توی میکسر و کمی هم اب اضافه کنید و با هم مخلوط کنید.مخلوط گوجه و پیاز رو بریزید روی مرغ و بهارات و بذارید تا مرغ بپزد. ماست رو با کمی اب مخلوط کنید و به مرغ اضافه کنید و ۵ دقیقه دیگه بذارید روی حرارت بمونه و با برنج و یا نان سرو کنید.'
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : 'ته چین مرغ',
                    imageUrl :require('./../../assets/images/dinner/tab3/i4.jpg'),
                    body : 'رنج آبکش شده سه لیوان،زرده تخم مرغ دو عدد،ماست نصف لیوان،زعفران دم کرده نصف لیوان،مرغ پخته و ریش شده دو لیوان،نمک و دارچین به مقدار لازم طرز تهیه: مرغ رو در مقدار کمی آب با پیاز و کمی نمک و زردچوبه و دارچین (در صورت تمایل) روی حرارت ملایم میگذاریم که بپزه. و بعدش ریش ریش میکنیم. ماست و زرده تخم مرغ و نصف زعفران دم کشیده رو با تقریبا نصف مقدار از برنجی که داریم مخلوط میکنیم و در قابلمه نچسبی که کفش رو از قبل چرب کردیم میریزیم. بعدش هم مقداری از مرغهای ریش شده رو روش میچینیم. و روی اون رو یک لایه از برنج و زعفران میریزیم و روی اون رو مرغ های ریش شده میچینیم و اونقدر این کارو تکرار میکنیم تا مرغ و برنجمون تموم شه.بعش هم روش رو کاملا با قاشق فشار میدیم تا مواد فشرده بشه و بعدش روی حرارت ملایم میگذاریم تا دم بکشه اگر دوست داشته باشین میتونین از زرشک و خلال بادام و پسته خیس داده و تفت داده در لایه ها استفاده کنین. در انتها کمی زیرش رو زیاد میکنیم تا ته دیگش بگیره و بعد از یک دقیقه زیرش رو خاموش میکنیم.وقتی که دم کشید برای اینکه راحت و یکدست از کف قابلمه جدا شه پشت قابلمه رو کمی آب سر میزنیم و بعد در ظرفی قابلمه رو برمیگردونیم تا ته چین کامل و یکدست برگرده. میتونید روش رو با زرشک و خلال بادام و پسته خیس کرده و تفت داده تزیین کنید'
                },
                {
                    id:'5',
                    prise:'70000',
                    title : ' مرغ شکم پر',
                    imageUrl :require('./../../assets/images/dinner/tab3/i5.jpg'),
                    body : 'مرغ ۱ عدد ، مغز گردو ۱/۲ لیوان ، پیاز ۲ عدد ،سیر ۲ حبه ،زعفران دم کرده ۲ قاشق چایخوری،سبزی معطر ( جعفری یا گشنیز ) ۲ قاشق غذاخوری ، رب گوجه فرنگی ۱ قاشق چایخوری،رب انار ۲ قاشق غذاخوری ، زرشک ۱ قاشق غذاخوری ،کره مقدار لازم ،نمک و فلفل مقدار لازم طرز تهیه :   داخل ماهیتابه مقداری روغن بریزید ، پیاز و سیر را خرد کنید و در روغن تفت دهید تا نرم شوند سپس سبزی معطر را اضافه کنید و تفت دهید تا سبزی سرخ شود ، در ادامه گردوهای خرد شده ، زرشک ، زعفران دم کرده ،رب گوجه فرنگی و رب انار را اضافه کنید ، کمی تفت دهید و از روی حرارت بردارید.موادی که آماده کرده اید را داخل شکم مرغ بریزید و با دست خوب پخش کنید تا تمام سطح داخلی مرغ به این مواد آغشته شود سپس با نخ کوک یا هر نوع نخ ضخیمی که دارید مرغ را جمع کنید.    بتدا نخ را از پشت گردن مرغ به سمت جلوی سینه ها بیاورید و زیر استخوان سینه نخ را بپیچانید سپس دو طرف نخ را به بخش انتهایی پای مرغ ۲ بار بچرخانید و گره بزنید ( در زمان پیچاندن نخ را بکشید تا مرغ جمع شود ). نخ های اضافی را قیچی کنید ، کره را آب کنید سپس با دست تمام سطح مرغ را با کره آب شده ماساژ دهید ( میتوانید برای آبدار ماندن مرغ زیر پوست سینه مرغ را به آرامی بلند کنید و فاصله میان پوست و گوشت را نیز به کره آغشته کنید ). پس از اماده شدن مرغ روی آن مقداری نمک و فلفل بپاشید ، مرغ را داخل ظرف پیرکس یا سینی فر قرار دهید و ۲ لیوان آب داخل ظرف بریزید ( میتوانید به جای آب با سبزیجاتی مانند سیب زمینی ، هویج و … زیر مرغ را پر کنید ). مرغ داخل فر با دمای ۱۸۰ درجه سانتیگراد به مدت ۱ ساعت قرار دهید تا مرغ پخته و روی آن طلایی شود ( ممکن است زمان بیشتری لازم باشد ) سپس نخ های اطراف مرغ را جدا کنید و مرغ را سرو نمایید.'
                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'مرغ بریان نمکی ',
                    imageUrl :require('./../../assets/images/dinner/tab3/i6.jpg'),
                    body : 'مواد لازم: مرغ درسته با پوست ۱ عدد بزرگ،نمک  ۲ بسته، نمک فلفل زردچوبه زعفران به مقدار لازم ، روغن زیتون یا کره مقداری ، سیب زمینی با پوست درسته  تعدادی ، گوجه ، فلفل دلمه ای و کرفس و پباز و سیر برای داخل شکم مرغ  طرز تهیه : ابتدا ته یک قابلمه یه ورقه آلومینیوم می اندازیم تا ته دیگ نسوزد سپس ۲ پاکت نمک را درون قابلمه خالی میکنیم و کنار میگذاریم در یک کاسه نمک ، فلفل، زردچوبه ، زعفران آبکرده و روغن زیتون مخلوطی نسبتاَ غلیظ درست کرده و تمام مرغ رابه آن آغشته می کنیم رو و داخل شکم مرغ را خوب با این مخلوط مالش میدیم تا به خردش برود سپس گوجه و کرفس و پیاز و دو حبه سیر را خرد کرده و شکم مرغ را با آن پر میکنیم شما با هر چیز دیگه غیر از این هم می توانید شکم مرغ را پر کنید و بعد از آن مرغ زعفران زده شکم پر را از کمر روی نمک ها می گذاریم و سیب زمینی ها را دور آن می چینیم و در قابلمه را دم کنی گذاشته و روی آن محکم می کنیم ابتدا به مدت ۱۵ دقیقه با حرارت زیاد و یکساعت و ربع با حرارت ملایم میگذاریم بپزد و بریان شود درقابلمه را در این مدت نباید باز کنیم ممکن است در ابتدا بوی نامطبوعی او نمک ها به مشام برسد که مهم نیست این مرغ طعم بسیار خوبی دارد و با هر نمونه مرغی که تا بحال پخته اید فرق دارد و بسیار آسان و بدون دردسر آماده میشه در ضمن به مقداری که ذائقه شما دوست دارد نمک به مرغ اضافه نمایید و نگران نمک های ته قابلمه نباشید که تأثیری در شوری غذا ندارند.'
                },
            ]
        })
    }

    render(){
        return(
            <Container  >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../../assets/images/l.jpg')} >
    <Content    >
       <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:1,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})