import React ,{Component} from 'react';
import { Container, Header, Content, Footer, CardItem, Input, Button, Text, View, Thumbnail, Card, Icon, Left, Right, Body, Title, Subtitle ,FooterTab} from 'native-base';


import {
 
  ImageBackground,StyleSheet,StatusBar,Image,FlatList,TouchableNativeFeedback,TouchableWithoutFeedback
} from 'react-native';
import { Actions } from 'react-native-router-flux';



export default class BreackfastTab3s extends Component{
    componentWillMount(){
        this.setState({
            articles : [

                { 
                    id:'1',
                     prise:'85000',
                    title : 'آموزش پروژه محور React Native',
                    prise:'85000',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i1.jpg'),
                    body : 'آجیل، دانه‌ها و میوه‌های خشک مانند بادام، گردو، دانه کدو، و توت خشک را مخلوط و میل کنید. اول هفته مقدار زیادی از آن را برای کل هفته مخلوط و تقسیم‌بندی کنید. این کار باعث می‌شود زمان بیشتری ذخیره کنید. همیشه از چربی‌ها بدگویی می‌شود اما چربی‌های خوب مانند چربی‌ داخل آجیل‌ها برای حفظ سطح تستوسترون بسیار مهم هستند. یک بسته اسمارتیز این مخلوط را از سالم بودن دور می‌کند پس از مواد قندی پرهیز کنید.'
                },
                
                {
                    id:'2',  
                    prise:'9000',
                    title : 'اجیل ',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i2.jpg'),
                    body : 'در این دوره قصد دارم webpack که یک module bundler برای جاوا اسکریپت هست رو به شما آموزش بدم . حالا module bundler چیه ؟ در جاوا اسکریپت همیشه احساس نیاز به ابزاری میشد که بتونه فایل های مختلفی مثل جاوا اسکریپت , تصاویر , فونت ها و موارد دیگه که تعدادشون هم در هر پروژه ای ممکنه خیلی خیلی زیاد باشه رو مدیریت کنه . حالا webpack میتونه به عنوان ورودی میتونه این فایل ها رو بگیره و هر بلایی که شما خواستین سر اطلاعات بیاره و در خروجی اطلاعات مورد انتظار شما رو برگردونه. حالا اگر میخواین اطلاعات بیشتری در مورد webpack بدست بیارید پس حتما قسمت معرفی و راه اندازی این دوره رو مشاهده کنید. '
                },
                { 
                    id:'3',
                    prise:'20000',
                    title : 'طرز تهیه حلیم',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i3.jpg'),
                    body : "گندم پوست کنده	۳۰۰ گرم  گوشت	۲۰۰ گرم پیاز	۱ عدد روغن	۱ قاشق غذاخوری شکر	به میزان لازم دارچین	به میزان لازم روغن	به میزان لازم  زردچوبه	به میزان لازم نمک	به میزان لازم"+"گندم را باید از شب قبل در آب بخیسانیم تا نرم شود. پس از اینکه گندم خوب خیس خورد ، آن را به همراه ۶ لیوان داخل یک قابلمه می ریزیم و روی حرارت قرار می دهیم. گوشت را هم جداگانه در یک قابلمه کوچک قرار می دهیم.  پیاز را به ۴ قسمت تقسیم می کنیم و به همراه ۲ لیوان آب به قابلمه گوشت اضافه می کنیم. مقداری زردچوبه هم به گوشت اضافه می کنیم و اجازه می دهیم گوشت کاملا بپزد. سپس آنرا از قابلمه خارج می کنیم و ریش ریش می کنیم. در این مرحله گوشت ریش ریش شده را به همراه مقداری نمک به قابلمه گندم اضافه می کنیم. توجه داشته باشید زمان اضافه کردن گوشت ، گندم باید شبیه به پوره شده باشد. نکته مهم در مورد حلیم این است که باید به صورت متداوم آنرا هم بزنیم."
                    
                    
            
                },
                {
                    id:'4',  
                    prise:'120000',
                    title : 'طرز تهیه ماکارانی',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i4.jpg'),
                    body : 'داخل قابلمه ای را از آب پر کنید و مقداری نمک و روغن بریزید و روی حرارت قرار دهید تا به جوش بیاید داخل قابلمه ای را از آب پر کنید و مقداری نمک و روغن بریزید و روی حرارت قرار دهید تا به جوش بیاید پیاز را ریز خرد کنید و در مقداری روغن تفت دهید تا نرم شود. پیاز را ریز خرد کنید و در مقداری روغن تفت دهید تا نرم شود سپس گوشت چرخ کرده را اضافه کنید و تفت دهید تا رنگ گوشت عوض شود. اجازه بدهید. 6-8 دقیقه به تفت دادن روی شعله ملایم ادامه دهید تا گوشت کاملاً پخته شود در ادامه نمک ، فلفل  و رب گوجه فرنگی را اضافه کنید. 2-3 دقیقه تفت بدهید تا رب هم سرخ شود و طعم بهتری پیدا کند. ته قابلمه مقداری روغن بریزید و آن را با سیب زمینی های حلقه شده یا نان بپوشانید. مقداری ماکارونی روی سیب زمینی ها بریزید و روی آن مقداری از مایه بریزید ( 2-3 لایه به همین صورت  ادامه بدهید و داخل قابلمه را پر کنید لایه آخر را با ماکارونی پوشش دهید و پودر آویشن را روی آن بپاشید ، در قابلمه را بگذارید و با حرارت کم اجازه دهید به مدت 35 – 45 دقیقه ماکارونی دم بکشدس ).. '
                },
                {
                    id:'5',
                    prise:'70000',
                    title : 'طرز تهیه عدسی ',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i5.jpg'),
                    body : 'عدس	۲٫۵ لیوان سیب زمینی	۱ عدد پیاز	۱ عدد آرد	۱ قاشق غذاخوری روغن زیتون	۲ قاشق غذاخوری رب گوجه فرنگی	۱ قاشق غذاخوری فلفل سیاه	به میزان لازم نمک	به میزان لازم  زردچوبه	به میزان لازم'
                },
                {  
                    id:'6',
                    prise:'6000',
                    title : 'طرز تهیه خوراک لوبیا ',
                    imageUrl :require('./../assets/images/breackfast/lastprise/i6.jpg'),
                    body : "لوبیا چیتی	۲ لیوان پیاز	۱ عدد سیر	۲ عدد قارچ	۴ عدد گوجه فرنگی	۱ عدد سیب زمینی	۱ عدد رب گوجه فرنگی	۲ قاشق غذاخوری فلفل سیاه	به میزان لازم نمک	به میزان لازم آبلیمو	به میزان لازم روغن مایع	به میزان لازم"+"ابتدا بهتر است برای رفع نفخ و سهولت در پخت لوبیا چیتی ، آن را از شب قبل در آب بخیسانیم. توجه داشته باشید که اگر بتوانید چند بار آب لوبیا چیتی را تغییر دهید به طور کامل نفخ آن برطرف می شود و در زمان پخت به راحتی می پزد.  در این مرحله پیاز را به صورت نگینی خرد می کنیم و با مقداری روغن مایع در یک تابه تفت می دهیم. پس از اینکه رنگ پیاز طلایی شد نصف آنها را بر میداریم و کنار می گذاریم. حالا سیر ها و گوجه فرنگی ها را خرد می کنیم و بعد از اضافه کردن به تابه تفت می دهیم. تفت دادن مواد را تا جایی ادامه می دهیم تا آب گوجه فرنگی ها کاملا تبخیر شود. در این مرحله پس از آبکش کردن لوبیا چیتی آنرا به همراه رب گوجه فرنگی به تابه اضافه می کنیم. مواد را خوب تفت می دهیم تا کاملا با هم مخلوط شوند. در این مرحله ۵ لیوان آب روی مواد می ریزیم و درب تابه را می گذاریم و اجازه می دهیم لوبیاها با حرارت بسیار ملایم حدود ۳ ساعت بپزد. سیب زمینی را به صورت مکعبی خرد می کنیم و در مقداری روغن تفت می دهیم تا نیم پز شود. پس از اینکه ۲ ساعت از پخت خوراک لوبیا گذشت سیب زمینی ها را به همراه نمک ، فلفل سیاه و نیمی از پیاز داغ که در مراحل قبل برداشتیم به خوراک اضافه می کنیم. در این مرحله قارچ ها را خرد می کنیم و به خوراک اضافه می کنیم.  پس از اضافه کردن مواد به خوراک حدود ۱ ساعت دیگر نیاز است تا خوراک لوبیا چیتی جا بیفتد و آماده سرو شود. پس از اینکه خوراک لوبیا چیتی آماده شد آنرا در ظرف مورد نظر می کشیم و به همراه آبلیمو و نان سرو می کنیم."
                },
            ]
        })
    }

    render(){
        return(
            <Container  >
                <StatusBar hidden />
               
                    <ImageBackground style={{flex: 1,

width: null,
height: null,}} source={require('./../assets/images/l.jpg')} >
    <Content    >
       <FlatList 
       data={this.state.articles}
       renderItem={({item})=>
       <TouchableNativeFeedback onPress={()=>Actions.breackfast2({title: item.title,image:item.imageUrl,body:item.body})}>
      
       <View style={styles.container}>

       <Image source={item.imageUrl} style={styles.image} />

       <View style={{ padding : 10}}>

           <Text >{item.title}</Text>

           <Text note numberOfLines={2} style={styles.body}>{item.body}</Text>

       </View>

   </View>
   </TouchableNativeFeedback>
   }
       keyExtractor={(item)=>item.id}
       numColumns={2}
       
       />
                     </Content>
    </ImageBackground>

                 
                
  



                </Container>
        )
    }
}
const styles=StyleSheet.create({
    container:{
      flex:1,
        margin: 5,
        backgroundColor : 'white',
        elevation : 1,
        shadowColor : '#000',
        shadowOffset : { width : 0 , height: 20},
        shadowOpacity : .2,
    
},
image:{
    width : '100%',
        height: 120
    
},


})